// регулярное выражение для номера телефона

/^(\+?375\-?|8\-?0)(25|29|33|44|17)\-?[1-9]\d{2}(\-?\d{2}){2}$/.test('8033-6666666');
/^(\+?375\-?|8\-?0)(25|29|33|44|17)\-?[1-9]\d{2}(\-?\d{2}){2}$/.test('+375-25-777-77-77');
/^(\+?375\-?|8\-?0)(25|29|33|44|17)\-?[1-9]\d{2}(\-?\d{2}){2}$/.test('375299999999');
/^(\+?375\-?|8\-?0)(25|29|33|44|17)\-?[1-9]\d{2}(\-?\d{2}){2}$/.test('8-044-444-44-44');


//подсчет гласных

function countVowelLetters(text) {
    var vowelArr = text.match(/[аяыиоёуюэеaeiouy]/igm);

    return vowelArr ? vowelArr.length : 'гласных нет';
}

countVowelLetters('Шла Саша по шоссе И сосала сУшку');
countVowelLetters('Прпвк мтрт');






